
// 5) კომენტარებით ახსენით რას ნიშნავს/რაში გამოიყენება dot notations - წერტილოვანი ნოტაციები 

//dot notation არის სინტაქსის ნაწილი, რითაც ჩვენ შეგვიძლია ჩავწეროთ ობიექტის თვისებები ან მეთოდები.

// 6) პრაქტიკული დავალება:
// შექმენით მარტივი პროგრამა რომელიც ცვლადში შენახული ციფრის ანუ თქვენი ასაკის მიხედვით თვლის ხართ თუ არა სრულწლოვანი და თუ არა მაშინ რამდენი წელიწადი გაკლიათ.

function adultOrNot(age){
    if (age >= 18){
        return "Your are adult!"
    } else{
        return `You will be adult in ${18 - age} Year`
    }
}

console.log(adultOrNot(1))