// ლექციის ჩამაწერი წაშლილია, ამ დავალებას ვერ შევასრულებ (პირობას ვერ მივხვდი ზუსტად)

// 1) html-ში შექმენით ორი პარაგრაფი, შემდეგ  js-ში აირჩიეთ ეს ორი პარაგრაფი და მიეცით ფერი, არ გამოიყენოთ მთოდები როგორიცაა .getElementById() და ა.შ.

// 2) შექმენით html პარაგრაფი და მიანიჭეთ ID ხოლო შექმენით სამი ახალი პარაგრაფი და მიანიჭეთ მათ ერთი class, შემდეგ .js ფაილში for loop ის გამოტყენებით შეცვალეთ ამ პარაგრაფერის შინაარსი და ფერი. ელემენტს რომელსაც მიანიჭებს ID უნდა მისცეთ on click eventListiner გამოიტანოს მოსწავლის სახელი და გვარი. 
