// 1)
// შექმენით ფუნქცია რომელიც დაბეჭდავს თქვენს სახელსა და გვარს და შემდეგ გამოიტანთ

function myName(){
    console.log("Nikoloz Tevdoradze")
    alert("Nikoloz Tevdoradze")
}

// 2)
// შექმენით ფუნქცია რომელიც გამოიტანს გამაფრთხილებელ მესიჯს, როდესაც თქვენ დააჭერთ ღილაკს სახელით "Know me"

//IN HTML

// 3)
// კომენტარებით ახსენით წინა 2 დავალება, ასევე დაწერეთ როგორ ვქმნით JavaScript-ში ფუნქციას და რა განსხვავებაა Python-ისა და JS-ს კოდის ბლოკებს შორის

// ჯავასკრიპტში ფუნქციას ვქმნით function - keyword ის, ფუნქციის სახელის, ჩვეულებრივი და ფიგურული ფრჩხილების დახმარებით. პითონში იგივეს გასაკეთებლად გვჭირდება def keyword, ფუნქციის სახელი, ჩვეულებრივი ფრჩხილები, ორწერტილი და სწორი ინდენტაცია(ჯავასკრიპს ინდენტაცია არ გააჩნია).

// 4)
// ჩამოწერეთ ყველა თქვენთვის ცნობილი კარგი პრაქტიკა და განიხილეთ თუ რას მოიცავენ ისინი

// ჩემთვის ცნობილი კარგი პრაქტიკებია ყოველი სრულყოფილი ბრძანების ბოლოს წერტილმძიმე, ან კიდევ ინდენტაცია, რომელიც არ ახდენს გავლენას კოდის მუშაობაზე

// 5)
// მომხარებელს შემოატანინეთ თავიანთი სახელი და გვარი, შემდეგ კი console-ში გამოიტანეთ რომ ეს კონკრეტული დარეგისტრირდა

let firstName = prompt("Enter your firstname")
let lastName = prompt("Enter your lastname")
console.log(firstName + " " + lastName + " is registered")