# DAY 107
# 1) შემოგდით n და n ზომის მასივი. დაბეჭდეთ მასივის ორი უდიდესი ელემენტის ჯამი.
#    მაგ 5, 18 12 40 1 19
#    პასუხია 40+19=59.

def two_biggest(list):
    list.sort()
    return list[-1] + list[-2]

# 2) შემოგდით n და n ზომის მასივი. თქვენი ამოცანაა იპოვოთ მასივში ყველაზე ბოლოს გამეორებული ელემენტი და დაბეჭდოთ იგი. თუ  ასეთი ელემენტი არ არსებობს დაბეჭდეთ რომ მასივში არცერთი ელემენტი არ მეორდება
# მაგ : 5, 1 3 4 1 3 12 
# პასუხია 3 (მასივში გამიმეორდა 1-იანი და 3-იანი თუმცა რადგან 3 უფრო გვიან გამეორდა ეგაა საძებნი ელემენტიც)

def last_repeat(list):
    lst = []
    for i in range(len(list)):
        if list.count(list[i]) > 1:
            lst.append(list[i])
    return lst[-1]

print(last_repeat([5, 1, 3, 4, 1, 3, 12]))

# 3) შემოდის n და n ზომის მასივი. თქვენი  ამოცანაა თითოეული ელემენტისთვის დაბეჭდოთ მის მარცხნივ მყოფ ელემენტებს შორის რამდენზე მეტია იგი.

# მაგ  n=5, 3 2 6 5 1

# პასუხია 0,0,2,2,0  (3-ის წინ არცერთი ელემეტნია, 2ის წინ 3ია თუმცა არაა მასზე მეტი , 6ის წინ 3 და 2  წერია რადგან ორივეზე მეტია დაიბეჭდება 2, 5ის 3 2 6 წერია ამათგან 2 მათგანზე მეტია აქაც 2 და ბოლოს 1იანი არცერთზე მეტი არაა და დაიბეჭდება 0 )

# წარმატებები ❤️ თუ რაიმე ვერ გაიგეთ მომწერეთ 🙂 

def to_left(list):
    lst = []
    counter = 0
    for i in range(len(list)):
        counter = 0
        for j in range(i):
            if list[i] > list[j]:
                counter += 1
        lst.append(counter)
    return lst
print(to_left([3, 2, 6, 5, 1]))
            
